from aiogram import Bot, Dispatcher, F
from aiogram.types import Message, ReplyKeyboardMarkup, KeyboardButton
from aiogram.filters import Command
from random import choice
import asyncio



bot = Bot(token="8686153073:AAHhzvSFo0r2HgBv5UhignG45B-6wjNp6p4")
dp = Dispatcher()

kb = ReplyKeyboardMarkup(
    keyboard=[
        [KeyboardButton(text="🗾Випадковий рецепт🎌")]
    ], resize_keyboard=True
)

@dp.message(Command("start"))
async def cmd_start(message: Message):
    await message.answer("Привіт! Це бот японської кухні! Натисніть на кнопку, щоб побачити рецепти", reply_markup=kb)

recipe = [

#1

    """Місо-супу з соєвим сиром тофу

інгредієнти:
- 500 мл - вода
- 100 г - сир тофу
- 40 г - місо-паста соєва світла Katana
- 30 г - зелена цибуля
- 4 г - сухі морські водорості вакаме Katana
- Соєвий соус «Класичний» Katana за смаком
- Кунжут білий Katana за смаком

Кроки приготування:
   1. Візьмемо каструлю і наллємо в неї 0,5 л води. Поставимо на плиту і доведемо до кипіння. Тепер зменшимо температуру до мінімуму і додамо водорості вакаме. Їх необхідно варити 1,5 хвилини.
   2. Додамо в каструлю місо-пасту і ретельно розмішаємо до її повного розчинення — бульйон повинен бути однорідним, без грудочок, тому часто пасту при додаванні перетирають через сито.
   3. Додамо за смаком соєвий соус, доведемо до кипіння і проваримо 2—3 хвилини.
   4. Щоб подача була більш автентичною, ми радимо використовувати глиняні лаковані піали — саме так суп подають в Японії. На дно покладемо шматочки тофу і дрібно порізану зелену цибулю. Розіллємо гарячий бульйон у тарілки та посиплемо кожну порцію кунжутом.
   
Хвилинка японської:
Кендзі: 味噌汁
Хірагана: みそしる
Катакана: ミソシル
Вимова: Miso shiru
Переклад: 味噌 (Miso) — ферментована соєва паста;
汁 (Shiru) — суп/бульйон.""",

#2

    """Оніґірі з тунцем

інгредієнти:
- 2 склянки рису для суші Японіка Katana
- 2 столові ложки рисового оцту для суші
- 1 столова ложка цукру
- 1 чайна ложка солі
- 1 банка консервованого тунця
- 2 столові ложки майонезу (за бажанням)
- Норі, нарізані на смужки
- Васабі (за бажанням)
- Чорний кунжут

Кроки приготування:
   1. Приготуйте рис. Використовуйте спеціальний круглозернистий рис для суші, він більш клейкий, тому онігірі буде краще тримає форму. Ретельно промийте рис, 3-4 рази зливайте воду. Варіть рис за інструкцією на упаковці або скористайтеся нашою детальною технологією приготування рису для суші.
   2. Якщо використовуєте консервований тунець, злийте рідину і змішайте тунець з майонезом (якщо бажаєте).
   3. Намочіть руки водою, щоб рис не прилипав, і візьміть невелику кількість рису. Розпластайте рис на долоні, зробіть невелике заглиблення в центрі і покладіть туди трохи начинки. Закрийте начинку рисом, додайте ще трохи рису, якщо потрібно, і сформуйте з нього трикутник або кульку. Повторіть з іншими порціями рису і начинки.
   4. Наріжте норі на смужки шириною приблизно 3 см. Оберніть смужку норі навколо нижньої частини кожного оніґірі.
   5. При бажанні посипте оніґірі кунжутом та подайте з васабі на стороні.
   
Хвилинка японської:
Кендзі: お握り
Хірагана: おにぎり
Катакана: オニギリ
Вимова: Onigiri
Переклад: 握り (Nigiri) — стискати/формувати руками.""",

#3

    """Якіторі

інгредієнти на 8 порцій:
- Курячі стегенця 16 шт
- Цибуля порей 4 шт
- Сіль за смаком

Соус:
- Соус соєвий 200 мл
- Соус мірін 100 мл
- Цукор 80 г
- Зелена цибуля за смаком

Кроки приготування:
   1. Покладіть у каструлю соєвий соус, цукор, мірін та стебла зеленої цибулі. Дайте приготуватись соусу на повільному вогні близько 20 хвилин.
   2. Замочіть дерев’яні шпажки у воді, щоб вони не згоріли під час приготування.
   3. Курячі стегенця помийте, обсушіть і наріжте середніми шматочками. Цибулю-порей помийте і наріжте шматочками завдовжки 3-4 см. Візьміть шпажки і насаджуйте шматочки курятини, чергуючи її з цибулею.
   4. Посоліть шашлички та обсмажте їх на гарячій сковороді з антипригарним покриттям або на грилі приблизно по 5 хвилин з кожного боку.
   5. Коли якіторі будуть майже готові, змастіть їх соусом. Можете подавати!
   
Хвилинка японської:
Кендзі: 焼き鳥
Хірагана: やきとり
Катакана: ヤキトリ
Вимова: Yakitori
Переклад: 焼き (Yaki) — смажений;
鳥 (Tori) — птах/курка.""",

#4

    """Данго

інгредієнти на 6 порцій:
- Рисове борошно 150 г
- 15 г білого цукру
- Вода 105 г

   Соус:
- Вода 50 г
- Соєвий соус 20 г
- Мірін 15 г
- Цукор 35 г
- Картопляний крохмаль 15 г
- Вода 30 г

Кроки приготування:
   1. Додайте цукор до рисового борошна, перемішайте, додайте воду і замісіть вручну. Відрегулюйте кількість води так, щоб консистенція була на відчуття приблизна як мочка вуха.
   2. Замішене тісто поділіть на 18 однакових частин.
   3. Сформуйте у долонях гарні кружечки, трішки притисніть їх та покладіть на аркуш для запікання.
   4. Закип’ятіть воду у каструлі і вкиньте данго варитися на 5-6 хвилин. Коли вони будуть готові, то випливуть доверху.
   5. Дістаньте їх сіткою та покладіть у воду з льодом.
   6. Після охолодження данго, злийте воду.
   7. Нанизайте данго на шпажки та смажте з обох сторін.
   8. В окремій кастрюльці смішайте воду, соєвий соус, мірін та цукор. Поставте на вогонь.
   9. Після того, як суміш закипить, зробіть маленький вогонь та поступово додавайте крохмаль, розчинений у воді.
   10. Продовжуйте варити помішуючи до згущення. Коли соус вже достатньо густий - нанесіть його на данго та смакуйте!
   
Хвилинка японської:
Кендзі: 団子
Хірагана: だんご
Катакана: ダンゴ
Вимова: Dango
Переклад: 団 (Dan) — група/кулька;
子 (Go) — малий об'єкт.""",

#5

    """Окономіякі

інгредієнти:
   Тонкацу (котлета зі свинини):
- Стейк із свинячої корейки
- Сіль
- Чорний перець
- Універсальне борошно або Кондитерське борошно
- Яйце
- Вода
- Нама-панко (панірувальні сухарі)
- Олія для смаження

   Бульйон:
- Вода 50 мл
- Боніто Хондаші або Комбу Хондаші 1/5 ч.л.
- Соєвий соус 1 ст.л.
- Мірін 1 ст.л.
- Цукор 1 ч.л.

   інші інгредієнти:
- Цибуля ріпчаста 70 г
- 1 яйце
- Петрушка Міцуба
- Свіжий приготовлений на пару рис 200 г

Кроки приготування:
   1. Наріжемо інгредієнти для Кацудону. Наріжте цибулю скибочками 5 мм (0,2 дюйми). Наріжте петрушку міцуба на шматочки розміром 1,5-2 см (0,6-0,8 дюйма).
   2. Приготуємо шматок свинячої корейки. Зробіть кілька надрізів на жорсткій, волокнистій частині між жиром та нежирним м'ясом. Переверніть та повторіть процес. Це запобіжить скручування свинини у фритюрі.
   3. Зм'якшити свинину лопаткою м'ясорубка. З одного боку посипте сіллю та перцем.
   4. Розбийте яйце в миску і покладіть його чвертю в неглибокий посуд. Додайте трохи води і добре збийте віночком.
   5. Посипте свинину з обох боків універсальним борошном.
   6. Обов'язково видаліть зайве борошно, а потім вмочіть свинину в яйце.
   7. Змастіть свинину по нама-панко, м'якими панірувальними сухарями і надайте форму руками.
   8. Змастіть свинину по нама-панко, м'якими панірувальними сухарями і надайте форму руками.
   9. Переверніть щипцями та готуйте з іншого боку ще 2–3 хвилини до золотистого кольору.
   10. Помістіть тонкацу, обсмажену у фритюрі котлету зі свинини на решітку для охолодження і злийте надлишки олії.
   11. Коли тонкацу охолоне, розріжте його на шматочки розміром 1,5-2 см
   12. Приготуємо соус кацудон. Змішайте воду, порошок бульйону даси, соєвий соус, мирин, цукор та цибулю у невеликий горщик. Злегка перемішайте паличками для їжі.
   13. Накрийте кришкою та увімкніть конфорку на середній вогонь. Коли він закипить, зменште вогонь до мінімуму і гасіть близько 3 хвилин.
   14. Коли цибуля повністю приготується, викладіть тонкацу в сковороду.
   15. Розбийте яйце в миску. Злегка збийте яйце і розподіліть по тонкацу.
   16. Знову накрийте кришкою та готуйте на сильному вогні 20-30 секунд. Зніміть кришку. Коли яйце досягне бажаної консистенції, прикрасьте петрушкою міцуба і вимкніть пальник.
   17. Викладіть свіжий приготовлений на пару рис у миску для рису. За допомогою току акуратно нанесіть суміш на рис.
   
Хвилинка японської:
    Окономіякі:
Кендзі: お好み焼き
Хірагана: おこのみやき
Катакана: オコノミヤキ
Вимова: Okonomiyaki
Переклад: 好み (Konomi) — те, що подобається;
焼き (Yaki) — смажене.

    Тонкацу:
Кендзі: 豚カツ
Хірагана: とんかつ
Катакана: トンカツ
Вимова: Tonkatsu
Переклад: 豚 (Ton) — свиня;
カツ (Katsu) — скорочення від "katsuretsu" (котлета).""",

#6

    """Кастела

інгредієнти:
Коричневий тростинний цукор 1 ст. л.
Борошно пшеничне 120 г
Яйця курячі 3 шт.
Цукор 120 г
Жовток яєчний 4 шт.
Мед 40 г
Молоко 30 мл
Олія соняшникова рафінована 30 мл

Кроки приготування:
   1. Перш ніж почати, відміряйте всі інгредієнти та відокремте жовтки від білків у різні миски. Накрийте їх і дайте їм дійти до кімнатної температури. Застеліть квадратну форму для випікання розміром 18 см  пергаментним папером, щоб краї трохи виступали. Посипте 1 столову ложку крупного цукру на пергаментний папір і відкладіть на потім. Почніть розігрівати духовку до 180 °C. Просійте всю частину борошна в миску та відкладіть.
   2. Вилийте 3 яєчні білки в чисту, суху скляну миску і збивайте на низькій/середньо-низькій швидкості до утворення піни і збільшення вдвічі. Додайте 120 г білого цукру-піску в 3-4 етапи, переконавшись, що він повністю розчинився перед додаванням наступної порції. Час від часу зіскрібайте стінки миски. Після розчинення цукру збільште швидкість до середньої/середньо-високої.
   3. Збивайте, поки не утвориться меренга зі стійкими піками, які тримаються прямо. Додавайте по одному 4 яєчні жовтки, збиваючи по 5-10 секунд кожен, щоб вони розчинилися. Влийте 40 г меду в меренгу і збивайте ще 10 секунд, перш ніж переключитися на лопатку.
   4. Просійте борошно в тісто по одній третині за раз і обережно вмішуйте лопаткою, щоб не втратити занадто багато повітря. У невеликій мисці збийте 30 мл цільного молока та 30 мл рослинної олії разом. Вİзьмİть 2-3 столові ложки тİста для випічки і додайте іго в миску. Збийте їх разом до однорідності. Вилийте суміш на лопатку і в тİсто для випічки, потім обережно вмішайте до однорідності. Готове тİсто має бути густим і гладким.
   5. Вилийте тİсто у застелену форму для випікання і за допомогою бамбукової шпажки проведİть лінії по поверхні, рухаючись вперед і назад зигзагоподібними рухами. Зробіть це в обох напрямках 3 рази, потім постукайте формою об стільницю, щоб видалити великИ бульбашки повітря. Поставте на верхню полицю духовки і випікайте 1 хвилину. Через одну хвилину виймİть пиріг і знову проведİть лİнії в обох напрямках. Повернİть на верхню полицю і повторİть ще дваЧ рази. Пısля третього разу розгладьте будь-якИ грудочки, а потім перемΙстΙть форму на середню полицю і випікайте 7 хвилин. Зменште температуру до 160 °C і випікайте близько 30-40 хвилин.
   6. Перевірте його приблизно на 25-й хвилині. Кастела готова, коли проколота шпажка виходить чистою. Пısля випікання постукайте нею об стільницю, щоб запобегти усадці. Остудьте клька хвилин, а потИм обережно витягнИть її з форми. Не знИмаючи пергаментний папір, загорніть всю кастелу у харчову плівку, поки она ще гаряча/тепла, потИм помIстIть її догори дном у великий герметичний контейнер і залиште на 24 години. Якщо вам живете у жаркому клIматI, дайте їй охолонути до кIмнатної температури, а потИм зберIгайте у холодильнику.
   7. Через 12-24 години пıсля вистоювання розгорнИть кастелу і обріжте краї.
   
Хвилинка японської:
Кендзі: 加須底羅 (використовується рідко)
Хірагана: かすてら
Катакана: カステラ
Вимова: Kasutera
Переклад: Бісквітний пиріг (назва походить від «хліб Кастилії»).""",

#7

    """Нерікірі (Вагаші)

інгредієнти на 12 порцій:
   Шіро-ан (паста із білої квасолі):
- Квасоля біла консервована 960 г
- Цукор 200 г
   Гюхі (м'яке тісто для мочі):
- Рисове борошно 32 г
- Вода 44 мл
- Харчовий барвник за смаком

Кроки приготування:
Широ-ан:
   1. Відцідити квасолю каннелліні і покласти у велику жароміцну миску, залити окропом так, щоб він покривав квасолю приблизно на 1 дюйм. Замочити приблизно на 10 хвилин, відкинути на дрібнопористий ситечко, щоб стекла вода. Промити квасолю під холодною проточною водою і відцідити.
Пюре:
   1. Поставити сито для борошна догори дном на плоску тацю, лопаткою або рисовою ложкою притиснути квасолю до стінок сита. Продовжуйте розтирати і притискати квасолю до сита рухами з боку в бік, поки не видавите всю квасолеву пасту крізь сітку. Шкурки, які залишилися на верхній частині сита, можна викинути. *Для цього можна використати звичайне ситечко.
   2. Викласти квасолеву пасту в каструлю з товстим дном, всипати цукор і варити на середньому вогні, постійно помішуючи, поки весь цукор не розплавиться. Спочатку вона буде вологою, оскільки цукор тане, продовжуйте помішувати, поки вона не стане сухою. Може піти 50 хвилин, якщо у вас є більша каструля, це буде гарним варіантом (вода випарується швидше, що скоротить процес приготування).
   3. Коли тісто почне підсихати, зменшуємо вогонь, щоб воно не пригоріло. Це робиться тоді, коли тісто утворює густу пасту, а на дні та боках сковорідки можна побачити кілька сухих шматочків тіста. На цьому етапі ви повинні бути в змозі зробити міцне заглиблення в квасолевій пасті пальцем, і паста не повинна прилипати до рук. Якщо вона все ще дуже липка, готуйте ще приблизно 5 або 10 хвилин. Важлива порада: Переконайтеся, що ви видалили достатньо води з широ-ан перед тим, як змішати його з гюхі, якщо він все ще містить занадто багато води під час змішування з гюхі, остаточне тісто для нерікірі стане водянистим, занадто м'яким, його буде важко формувати, і шляху назад вже не буде.
   4. Зняти з вогню і викладіть широ-ан на сковороду, щоб він повністю охолов. Будь-яке тісто, бобова паста або вагаші не повинні залишатися на повітрі занадто довго. Коли тісто охолоне, відкласти 200 г широ-ан для начинки (накрити поліетиленовою плівкою), а решту залишити для тіста нерікірі.
   Гюхі:
   1. У невеликій каструлі змішати клейке рисове борошно і воду. Перемішуємо, поки не залишиться грудочок. Варити на середньому повільному вогні, постійно помішуючи, доки суміш не стане трохи прозорою, липкою і густою, зняти з вогню і дати їй трохи охолонути.
   Змішування:
   1. Співвідношення широ-ан і гюхі має бути 10 на 1; наприклад, 500 г широ-ан, 50 г гюхі. Нарізати гюхі невеликими шматочками і покласти до широ-ан, добре перемішати до однорідної консистенції. Стискати тісто руками протягом приблизно 2 хвилин, поки суміш не стане м'якою і податливою (тісто не повинно сильно прилипати до пальців).
   2. Перекласти тісто на чисту бавовняну тканину, руками скласти і вимісити тісто всередині тканини (повторити цей процес кілька разів протягом 1-2 хвилин). Потім потягнути і розірвати тісто на маленькі шматочки, покласти їх всередину бавовняної тканини і дати їм відпочити протягом 1 хвилини. Через 1 хвилину зібрати всі маленькі шматочки разом і знову вимісити протягом 1 хвилини (тісто стане гладким і дуже м'яким). Накрити його поліетиленовою плівкою.
   3. Розфарбувати та сформувати тісто відповідно до відео. *1 порція Нерікірі містить 20 г начинки Широ-Ан та 35 г тіста Нерікірі.

Хвилинка японської:
Кендзі: 練り切り 和菓子
Хірагана: ねりきり わがし
Катакана: ネリキリ ワガシ
Вимова: Nerikiri wagashi
Переклад: 練り (Neri) — вимішувати;
切り (Kiri) — різати;
和 (Wa) — японський;
菓子 (Gashi) — солодощі.""",

#8

    """Сакура мочі

інгредієнти на 6 порцій:
- 1 чашка рису мочігоме (рису для солодощів)
- 6 листків вишні
- 15 г цукру
- 175 мл води
- 2 краплі рожевого харчового барвника (або 2 ст. л. порошку сакури)
- 120 г анко

Кроки приготування:
   1. Промийте рис 3 рази. Замочіть на 8 годин. Протріть рис через сито, щоб стекла вода, і дайте обсохнути 5-10 хвилин. Перекладіть рис на марлю і потріть його качалкою або чимось міцним, щоб рис подрібнився.
   2. Перемістіть рис у миску, додайте 175 мл води, 15 г цукру та 2 краплі рожевого харчового барвника. Збийте.
   3. Накрийте миску поліетиленовою плівкою та поставте в мікрохвильову піч на 2 хвилини. Перемішайте і повторіть ще двічі.
   4. Перемішайте ще раз, потім нещільно накрийте кришкою. Охолодіть ваші мочі 15 хвилин.
   5. Зробіть кульки з анко (6 кульок вагою 20 г кожна).
   6. Змочіть рисову лопатку та розділіть мочі на 6 частин. Змочіть руки холодною водою і скачайте кожну частину в кульку. Притисніть кульку мочі до долоні. Або помістіть кульку мочі між двома квадратами пергаментного паперу та порівняйте качалкою. Помістіть кульку анко в центр. Змочіть пальці, а потім затисніть краї мочі навколо кульки анко, щоб закрити її. Загортаємо листком сакури.

Хвилинка японської:
Кендзі: 桜餅
Хірагана: さくらもち
Катакана: サクラモチ
Вимова: Sakura mochi
Переклад: 桜 (Sakura) — вишня/сакура;
餅 (Mochi) — рисовий коржик.""",

#9

    """Мандзю

інгредієнти на 12 порцій:
- Борошно пшеничне 2.5 скл.
- Розпушувач 4 ч. л.
- Цукор 1/4 скл.
- Вода 2/3 скл.
- Квасоля червона, консервована 340 г

Кроки приготування:
   1. У велику миску просійте борошно та розпушувач. Додайте цукор і добре перемішайте.
   2. Поступово вливайте воду в борошно, помішуючи, щоб інгредієнти з’єдналися. Добре вимісіть тісто, поки воно не стане гладким.
   3. Змішайте квасолю із 1-2 ст. ложками цукру, пюруйте в блендері.
   4. Розділіть тісто на 12 частин. Зробіть круглі кульки й розплющте їх. У центр кожної кульки покладіть ложку начинки. Заліпіть і сформуйте круглу кулю. 
   5. Покладіть кожну кульку на невеликий аркуш пергаментного паперу. Розігрійте пароварку. Помістіть пиріжки в пароварку та готуйте на парі близько 10-15 хвилин. Подавайте негайно.
   
Хвилинка японської:
Кендзі: 饅頭
Хірагана: まんじゅう
Катакана: マンジュウ
Вимова: Manjū
Переклад: 饅 (Man) — назва виду хлібця;
頭 (Jū/Tō) — голова (в даному контексті — круглий предмет).""",

#10

    """Темпура

інгредієнти:
- 500 г м’яса (наприклад, свинина, курка, яловичина або креветки) або овочі
- 3 ст. л. панірувальної суміші Темпура Asian, Indian, або Mexican style
- 8 ст. л. холодної води
- Олія (для смаження)

Кроки приготування:
    1. Підготуйте мясо або овочі, наріжте рівними шматочками або смужками за бажанням.
    2. У глибокій мисці ретельно змішайте до однорідної маси темпурну суміш та воду.
    3. Розігрійте олію в глибокій сковороді або каструлі. Вона повинна бути достатньо гарячою, щоб м’ясо швидко запеклося.
    4. Занурте овочі, креветки або м’ясо у готовий кляр, повністю покриваючи їх.
    5. Обсмажте при температурі 180°C протягом 3-4 хв до золотистої скоринки.
    6. Після приготування, вийміть його з олії і перекладіть на паперову рушник для зняття надлишкової олії.
    
Хвилинка японської:
Кендзі: 天ぷら
Хірагана: てんぷら
Катакана: テンプラ
Вимова: Tempura
Переклад: 天 (Ten) — небо/небеса;
ぷら (Pura) — частина слова, що походить від португальського «tempora» (час).""",
]

@dp.message(F.text == "🗾Випадковий рецепт🎌")
async def cmd_rest(message: Message):
    await message.answer(choice(recipe))



async def main():
    await dp.start_polling(bot)

asyncio.run(main())
